bob/bob-baseline.log
seq-read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
rand-read: (g=1): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
seq-write: (g=2): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
rand-write: (g=3): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
fio-3.25
Starting 4 processes
seq-read: Laying out IO file (1 file / 10240MiB)

seq-read: (groupid=0, jobs=1): err= 0: pid=11403: Tue Aug 16 11:46:56 2022
  read: IOPS=118k, BW=463MiB/s (485MB/s)(10.0GiB/22131msec)
    slat (usec): min=3, max=109, avg= 6.36, stdev= 1.09
    clat (usec): min=20, max=1078, avg=26.34, stdev= 7.69
     lat (usec): min=25, max=1082, avg=32.85, stdev= 7.68
    clat percentiles (usec):
     |  1.00th=[   25],  5.00th=[   25], 10.00th=[   25], 20.00th=[   25],
     | 30.00th=[   26], 40.00th=[   26], 50.00th=[   26], 60.00th=[   26],
     | 70.00th=[   26], 80.00th=[   26], 90.00th=[   26], 95.00th=[   27],
     | 99.00th=[   80], 99.50th=[   95], 99.90th=[   95], 99.95th=[   95],
     | 99.99th=[  125]
   bw (  KiB/s): min=159120, max=490720, per=100.00%, avg=474653.02, stdev=50036.09, samples=44
   iops        : min=39780, max=122680, avg=118663.20, stdev=12509.03, samples=44
  lat (usec)   : 50=98.94%, 100=1.03%, 250=0.03%, 500=0.01%, 750=0.01%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=29.95%, sys=68.22%, ctx=29642, majf=0, minf=27
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2621440,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-read: (groupid=1, jobs=1): err= 0: pid=11413: Tue Aug 16 11:46:56 2022
  read: IOPS=44.8k, BW=175MiB/s (184MB/s)(10.0GiB/58504msec)
    slat (usec): min=3, max=106, avg= 5.60, stdev= 1.29
    clat (usec): min=23, max=853, avg=82.11, stdev=16.26
     lat (usec): min=33, max=858, avg=87.88, stdev=16.06
    clat percentiles (usec):
     |  1.00th=[   67],  5.00th=[   70], 10.00th=[   70], 20.00th=[   72],
     | 30.00th=[   73], 40.00th=[   75], 50.00th=[   76], 60.00th=[   79],
     | 70.00th=[   84], 80.00th=[   91], 90.00th=[  110], 95.00th=[  117],
     | 99.00th=[  131], 99.50th=[  141], 99.90th=[  167], 99.95th=[  180],
     | 99.99th=[  255]
   bw (  KiB/s): min=177360, max=182632, per=100.00%, avg=179463.95, stdev=585.05, samples=116
   iops        : min=44340, max=45658, avg=44865.93, stdev=146.26, samples=116
  lat (usec)   : 50=0.01%, 100=85.36%, 250=14.63%, 500=0.01%, 750=0.01%
  lat (usec)   : 1000=0.01%
  cpu          : usr=14.03%, sys=32.18%, ctx=1550638, majf=0, minf=27
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2621440,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
seq-write: (groupid=2, jobs=1): err= 0: pid=11430: Tue Aug 16 11:46:56 2022
  write: IOPS=116k, BW=453MiB/s (475MB/s)(10.0GiB/22612msec); 0 zone resets
    slat (usec): min=4, max=160, avg= 4.94, stdev= 1.20
    clat (usec): min=14, max=7218, avg=28.54, stdev=57.84
     lat (usec): min=23, max=7222, avg=33.66, stdev=57.89
    clat percentiles (usec):
     |  1.00th=[   24],  5.00th=[   24], 10.00th=[   24], 20.00th=[   24],
     | 30.00th=[   25], 40.00th=[   25], 50.00th=[   26], 60.00th=[   28],
     | 70.00th=[   29], 80.00th=[   30], 90.00th=[   34], 95.00th=[   39],
     | 99.00th=[   45], 99.50th=[   46], 99.90th=[   59], 99.95th=[  208],
     | 99.99th=[ 2212]
   bw (  KiB/s): min=300784, max=484480, per=100.00%, avg=464345.69, stdev=43051.81, samples=45
   iops        : min=75196, max=121120, avg=116086.42, stdev=10762.95, samples=45
  lat (usec)   : 20=0.44%, 50=99.35%, 100=0.13%, 250=0.03%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.03%, 10=0.01%
  cpu          : usr=22.39%, sys=64.29%, ctx=935513, majf=0, minf=36
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2621440,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-write: (groupid=3, jobs=1): err= 0: pid=11432: Tue Aug 16 11:46:56 2022
  write: IOPS=73.1k, BW=285MiB/s (299MB/s)(10.0GiB/35867msec); 0 zone resets
    slat (nsec): min=4200, max=99952, avg=4930.74, stdev=795.45
    clat (usec): min=16, max=121677, avg=48.61, stdev=710.59
     lat (usec): min=24, max=121682, avg=53.70, stdev=710.59
    clat percentiles (usec):
     |  1.00th=[   21],  5.00th=[   25], 10.00th=[   25], 20.00th=[   25],
     | 30.00th=[   25], 40.00th=[   25], 50.00th=[   26], 60.00th=[   26],
     | 70.00th=[   28], 80.00th=[   29], 90.00th=[   34], 95.00th=[   35],
     | 99.00th=[   49], 99.50th=[ 1057], 99.90th=[ 3818], 99.95th=[ 5145],
     | 99.99th=[15795]
   bw (  KiB/s): min=67760, max=358552, per=100.00%, avg=294647.55, stdev=71993.83, samples=71
   iops        : min=16940, max=89638, avg=73661.89, stdev=17998.46, samples=71
  lat (usec)   : 20=0.08%, 50=98.95%, 100=0.08%, 250=0.05%, 500=0.01%
  lat (usec)   : 750=0.28%, 1000=0.01%
  lat (msec)   : 2=0.28%, 4=0.19%, 10=0.07%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=16.96%, sys=38.72%, ctx=693253, majf=0, minf=20
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2621440,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=463MiB/s (485MB/s), 463MiB/s-463MiB/s (485MB/s-485MB/s), io=10.0GiB (10.7GB), run=22131-22131msec

Run status group 1 (all jobs):
   READ: bw=175MiB/s (184MB/s), 175MiB/s-175MiB/s (184MB/s-184MB/s), io=10.0GiB (10.7GB), run=58504-58504msec

Run status group 2 (all jobs):
  WRITE: bw=453MiB/s (475MB/s), 453MiB/s-453MiB/s (475MB/s-475MB/s), io=10.0GiB (10.7GB), run=22612-22612msec

Run status group 3 (all jobs):
  WRITE: bw=285MiB/s (299MB/s), 285MiB/s-285MiB/s (299MB/s-299MB/s), io=10.0GiB (10.7GB), run=35867-35867msec

Disk stats (read/write):
  nvme0n1: ios=5242880/5238616, merge=0/100, ticks=246298/185640, in_queue=431954, util=99.27%